In [63]:
import  pandas as pd
import numpy as np

In [77]:
a = pd.DataFrame({'transport_turi':['poyezd','avtomabil','kema'], 
                  'tezligi':['70', '180', '45']})
a

  transport_turi tezligi
0         poyezd      70
1      avtomabil     180
2           kema      45

In [68]:
b = pd.DataFrame({'transport':['poyezd','avtomabil','samalyot'], 
                  'narx':['98000', '10000', '450000']})
b

   transport    narx
0     poyezd   98000
1  avtomabil   10000
2   samalyot  450000

In [71]:
merged = pd.merge(a,b)
merged

   transport tezligi   narx
0     poyezd      70  98000
1  avtomabil     180  10000

In [70]:
merged = pd.merge(a,b, how ='outer')
merged

   transport tezligi    narx
0     poyezd      70   98000
1  avtomabil     180   10000
2       kema      45     NaN
3   samalyot     NaN  450000

In [78]:
a = a.set_index('transport_turi')
a

               tezligi
transport_turi
poyezd              70
avtomabil          180
kema                45

In [83]:
a

               tezligi
transport_turi
poyezd              70
avtomabil          180
kema                45

In [85]:
merg = pd.merge(a, b, left_index = True, right_on ='transport')
merg

  tezligi  transport   narx
0      70     poyezd  98000
1     180  avtomabil  10000